Repository: ken-hori-2/PersonaStamp_Studio
Catalog: create_stamp/mobile/stamp_creator/stamp_creator/Localizable.xcstrings
Source language: en
Languages: ja

source: Add background color
ja: 背景色を追加

source: Adjust with the slider to preview. Press Compose to create the final image, then Save.
ja: スライダーで調整してプレビュー。「構成」で最終画像を作成し、「保存」でベース画像を保存。

source: Audio file not found
ja: 音声ファイルが見つかりません

source: Audio generated successfully
ja: 音声を生成しました

source: Audio Sticker
ja: 音声スタンプ

source: Background Color
ja: 背景色

source: Background Settings
ja: 背景設定

source: Change Image
ja: 画像を変更

source: chars
ja: 文字

source: Close
ja: 閉じる

source: Color
ja: 色

source: Compose
ja: 構成

source: Compose Base
ja: ベース構成

source: Composing...
ja: 構成中...

source: Composition Options
ja: 構成オプション

source: Converts your text into spoken audio.
ja: 入力したテキストを音声で読み上げます。

source: Create Audio Sticker
ja: 音声スタンプ作成

source: Delete
ja: 削除

source: Detects en/ja from text and reads aloud: alphabets → English; hiragana, katakana, kanji → Japanese.
ja: 入力から en/ja を判定して読み上げ：アルファベット→英語、ひらがな・カタカナ・漢字→日本語。

source: Done
ja: 完了

source: Edit
ja: 編集

source: Edit Sticker
ja: スタンプ編集

source: Edit Text
ja: テキスト編集

source: Enter text
ja: テキストを入力

source: Enter text for audio...
ja: 音声用のテキストを入力...

source: Enter text, press Generate Audio to create audio, play to preview audio, then Save to save the sticker.
ja: テキストを入力し、「音声生成」で音声を作成、「再生」で音声を再生、「保存」でスタンプを保存。

source: Error
ja: エラー

source: Extracted Image
ja: 抽出画像

source: Failed to convert image to PNG
ja: PNGへの変換に失敗しました

source: Failed to create audio buffer
ja: オーディオバッファの作成に失敗しました

source: Failed to generate PNG data
ja: PNGデータの生成に失敗しました

source: Failed to get image
ja: 画像の取得に失敗しました

source: Failed to analyze image: %@
ja: 画像の解析に失敗: %@

# failed_to_compose
source: Failed to compose image: %@
ja: ベースの構成に失敗: %@

source: Failed to convert image
ja: 画像の変換に失敗しました

source: Failed to generate audio: %@
ja: 音声の生成に失敗: %@

source: Failed to play audio: %@
ja: 音声の再生に失敗: %@

source: Failed to remove background: %@
ja: 背景除去に失敗: %@

source: Failed to save: %@
ja: 保存に失敗: %@

source: Font
ja: フォント

source: Generate Audio
ja: 音声生成

source: Generating...
ja: 生成中...

source: Image and audio are required
ja: 画像と音声が必要です

source: Image Size
ja: 画像サイズ

source: Info
ja: 情報

source: Long press to select subject, tap to deselect
ja: 長押しで被写体を選択し、タップで解除。

source: No composed image available
ja: ベース画像がありません

source: No image selected
ja: 画像が選択されていません

source: Pause Audio
ja: 一時停止

source: Photo library access permission is required
ja: 写真ライブラリへのアクセス許可が必要です

source: Play Audio
ja: 再生

source: Please enter text
ja: テキストを入力してください

source: Please long press to select a subject
ja: 長押しして被写体を選択してください

source: Please select an extracted image
ja: 抽出した画像を選択してください

source: Please select an image
ja: 画像を選択してください

source: Preview
ja: プレビュー

source: Processing...
ja: 処理中...

source: Remove Background
ja: 背景除去

source: Remove BG
ja: 背景除去

source: Save
ja: 保存

source: Saved successfully
ja: 保存しました

source: Saving...
ja: 保存中...

source: Select an extracted image to place on a square background
ja: 正方形の背景に配置する画像を選択

source: Select an image to create an audio sticker
ja: 音声スタンプ用の画像を選択

source: Select an image to edit
ja: 編集する画像を選択

source: Select an image to remove its background
ja: 背景を除去する画像を選択

source: Select Image
ja: 画像を選択

source: Selected Image
ja: 選択した画像

source: Set background color and size, adjust with the slider to preview. Press Compose to create the final image, then Save.
ja: 背景色とサイズを設定し、スライダーで調整してプレビュー。「構成」で最終画像を作成し、「保存」でベース画像を保存。

source: Square Size
ja: キャンバスサイズ

source: Success
ja: 成功

source: Tap image or Edit button to start editing
ja: 画像をタップ、または「編集」ボタンで編集を開始。

source: Tap to choose an image and start editing
ja: タップしてスタンプ画像を選び、編集を開始

source: Text
ja: テキスト

source: Text color
ja: テキスト色

source: Text Input
ja: テキスト入力

source: Transparent
ja: 透明

source: Unknown error
ja: 不明なエラー

source: White
ja: 白
